{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-BUS",
    "2": "I-BUS",
    "3": "B-TECHNOLOGY",
    "4": "I-TECHNOLOGY",
    "5": "B-TECHNICAL",
    "6": "I-TECHNICAL",
    "7": "B-SOFT",
    "8": "I-SOFT"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-BUS": 1,
    "B-SOFT": 7,
    "B-TECHNICAL": 5,
    "B-TECHNOLOGY": 3,
    "I-BUS": 2,
    "I-SOFT": 8,
    "I-TECHNICAL": 6,
    "I-TECHNOLOGY": 4,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.53.1",
  "vocab_size": 30522
}
